-- Active: 1666592657434@@127.0.0.1@3306@liin
CREATE TABLE field_lists (  
    seq BIGINT NOT NULL AUTO_INCREMENT COMMENT '流水編號',
    formcode CHAR(10) NOT NULL COMMENT '表單編號',
    formstate TINYINT NOT NULL DEFAULT 15 COMMENT '表單狀況',
    creator VARCHAR(20) NOT NULL COMMENT '建立者',
    creatdate DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP() COMMENT '建立日期',
    modifier VARCHAR(20) NOT NULL COMMENT '修改者',
    modifydate DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP() COMMENT '修改日期',
    listcls VARCHAR(60) NOT NULL COMMENT '欄位類別名稱',
    listcode VARCHAR(20) NOT NULL COMMENT '欄位清單代碼',
    listapl VARCHAR(300) NOT NULL COMMENT '欄位清單名稱',

    INDEX list_seq_idx(seq),
    INDEX list_listcls_idx(listcls),
    INDEX list_listapl_idx(listapl),
    PRIMARY KEY (formcode)
) COMMENT '欄位清單檔';

INSERT INTO field_lists (formcode, creator, modifier, listcls, listcode, listapl) VALUES 
    ('2022100001', '徐培文', '徐培文', '職稱', 'POS001', '主任')
    , ('2022100002', '徐培文', '徐培文', '職稱', 'POS002', '業務負責人')
    , ('2022100003', '徐培文', '徐培文', '職稱', 'POS003', '會計')
    , ('2022100004', '徐培文', '徐培文', '職稱', 'POS004', '人事')
    , ('2022100005', '徐培文', '徐培文', '職稱', 'POS005', '總務')
    , ('2022100006', '徐培文', '徐培文', '職稱', 'POS006', '護理人員')
    , ('2022100007', '徐培文', '徐培文', '職稱', 'POS007', '復能老師')
    , ('2022100008', '徐培文', '徐培文', '職稱', 'POS008', '呼吸治療師')
    , ('2022100009', '徐培文', '徐培文', '職稱', 'POS009', '社工組長')
    , ('2022100010', '徐培文', '徐培文', '職稱', 'POS010', '社工')
    , ('2022100011', '徐培文', '徐培文', '職稱', 'POS011', '個管師')
    , ('2022100012', '徐培文', '徐培文', '職稱', 'POS012', '督導')
    , ('2022100013', '徐培文', '徐培文', '職稱', 'POS013', '照顧服務員')
    , ('2022100014', '徐培文', '徐培文', '職稱', 'POS014', '司機')
    , ('2022100015', '徐培文', '徐培文', '職稱', 'POS015', '廚師')
    , ('2022100016', '徐培文', '徐培文', '職稱', 'POS016', '清潔人員')
    , ('2022100017', '徐培文', '徐培文', '職稱', 'POS017', '行政人員')
    , ('2022100018', '徐培文', '徐培文', '職稱', 'POS018', '資訊')
    , ('2022100019', '徐培文', '徐培文', '職稱', 'POS019', '行銷企劃')
    , ('2022100020', '徐培文', '徐培文', '職稱', 'POS020', '志工')
    , ('2022100021', '徐培文', '徐培文', '職稱', 'POS021', '其他')
    , ('2022100022', '徐培文', '徐培文', '國家', 'CTY001', '台灣')
    , ('2022100023', '徐培文', '徐培文', '國家', 'CTY002', '印尼')
    , ('2022100024', '徐培文', '徐培文', '國家', 'CTY003', '越南')
    , ('2022100025', '徐培文', '徐培文', '國家', 'CTY004', '中國')
    , ('2022100026', '徐培文', '徐培文', '教育程度', 'EDU001', '研究所以上')
    , ('2022100027', '徐培文', '徐培文', '教育程度', 'EDU002', '大學/專科')
    , ('2022100028', '徐培文', '徐培文', '教育程度', 'EDU003', '高中/高職')
    , ('2022100029', '徐培文', '徐培文', '教育程度', 'EDU004', '國中')
    , ('2022100030', '徐培文', '徐培文', '教育程度', 'EDU005', '國小')
    , ('2022100031', '徐培文', '徐培文', '教育程度', 'EDU006', '不識字')
    , ('2022100032', '徐培文', '徐培文', '聯絡人', 'LIS001', '配偶')
    , ('2022100033', '徐培文', '徐培文', '聯絡人', 'LIS002', '兒子')
    , ('2022100034', '徐培文', '徐培文', '聯絡人', 'LIS003', '女兒')
    , ('2022100035', '徐培文', '徐培文', '聯絡人', 'LIS004', '媳婦')
    , ('2022100036', '徐培文', '徐培文', '聯絡人', 'LIS005', '女婿')
    , ('2022100037', '徐培文', '徐培文', '聯絡人', 'LIS006', '兄弟姊妹')
    , ('2022100038', '徐培文', '徐培文', '聯絡人', 'LIS007', '孫子')
    , ('2022100039', '徐培文', '徐培文', '聯絡人', 'LIS008', '孫女')
    , ('2022100040', '徐培文', '徐培文', '聯絡人', 'LIS009', '父親')
    , ('2022100041', '徐培文', '徐培文', '聯絡人', 'LIS010', '母親')
    , ('2022100042', '徐培文', '徐培文', '聯絡人', 'LIS011', '堂表兄弟姊妹')
    , ('2022100043', '徐培文', '徐培文', '聯絡人', 'LIS012', '朋友')
    , ('2022100044', '徐培文', '徐培文', '聯絡人', 'LIS013', '鄰居')
    , ('2022100045', '徐培文', '徐培文', '聯絡人', 'LIS014', '其他親戚')
    , ('2022100046', '徐培文', '徐培文', '聯絡人', 'LIS015', '其他')
    , ('2022100047', '徐培文', '徐培文', '聯絡人', 'LIS016', '看護')
    , ('2022100048', '徐培文', '徐培文', '婚姻狀況', 'MRG001', '單身')
    , ('2022100049', '徐培文', '徐培文', '婚姻狀況', 'MRG002', '已婚')
    , ('2022100050', '徐培文', '徐培文', '婚姻狀況', 'MRG003', '未婚')
    , ('2022100051', '徐培文', '徐培文', '婚姻狀況', 'MRG004', '離婚')
    , ('2022100052', '徐培文', '徐培文', '婚姻狀況', 'MRG005', '分居')
    , ('2022100053', '徐培文', '徐培文', '婚姻狀況', 'MRG006', '喪偶')
    , ('2022100054', '徐培文', '徐培文', '上班班別', 'WRKTIM001', '護理白班')
    , ('2022100055', '徐培文', '徐培文', '上班班別', 'WRKTIM002', '護理小夜')
    , ('2022100056', '徐培文', '徐培文', '上班班別', 'WRKTIM003', '護理大夜')
    , ('2022100057', '徐培文', '徐培文', '上班班別', 'WRKTIM004', '白班')
    , ('2022100058', '徐培文', '徐培文', '上班班別', 'WRKTIM005', '小夜班')
    , ('2022100059', '徐培文', '徐培文', '上班班別', 'WRKTIM006', '大夜班')
    , ('2022100060', '徐培文', '徐培文', '上班班別', 'WRKTIM007', '假日值班')
    , ('2022100061', '徐培文', '徐培文', '上班班別', 'WRKTIM008', '行政正常班')
    , ('2022100062', '徐培文', '徐培文', '相關工作', 'OTRWRK001', '護理')
    , ('2022100063', '徐培文', '徐培文', '相關工作', 'OTRWRK002', '社工')
    , ('2022100064', '徐培文', '徐培文', '相關工作', 'OTRWRK003', '行政')
    , ('2022100065', '徐培文', '徐培文', '相關工作', 'OTRWRK004', '復健')
    , ('2022100066', '徐培文', '徐培文', '相關工作', 'OTRWRK005', '營養')
    , ('2022100067', '徐培文', '徐培文', '相關工作', 'OTRWRK006', '庫房')
    , ('2022100068', '徐培文', '徐培文', '相關工作', 'OTRWRK007', '醫師')
    , ('2022100069', '徐培文', '徐培文', '相關工作', 'OTRWRK008', '藥師')
    , ('2022100070', '徐培文', '徐培文', '相關工作', 'OTRWRK009', '服務人員')
    , ('2022100071', '徐培文', '徐培文', '相關工作', 'OTRWRK010', '督導員')
    , ('2022100072', '徐培文', '徐培文', '相關工作', 'OTRWRK011', '個管師')
    , ('2022100073', '徐培文', '徐培文', '常用語言', 'LANG001', '國語')
    , ('2022100074', '徐培文', '徐培文', '常用語言', 'LANG002', '台語')
    , ('2022100075', '徐培文', '徐培文', '常用語言', 'LANG003', '客家語')
    , ('2022100076', '徐培文', '徐培文', '常用語言', 'LANG004', '英語')
    , ('2022100077', '徐培文', '徐培文', '常用語言', 'LANG005', '日語')
    , ('2022100078', '徐培文', '徐培文', '常用語言', 'LANG006', '其他')
    , ('2022100079', '徐培文', '徐培文', '血型', 'BLD001', 'A')
    , ('2022100080', '徐培文', '徐培文', '血型', 'BLD002', 'B')
    , ('2022100081', '徐培文', '徐培文', '血型', 'BLD003', 'O')
    , ('2022100082', '徐培文', '徐培文', '血型', 'BLD004', 'AB')
;


